src/cf/Catalogs/узСпринты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>узСпринты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпринтЗавершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветСпринта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧЗадачи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.узЗадачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/узСпринтыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>узСпринтыЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Спринт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узСпринты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/узСпринты/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	ОчиститьЗаписи_узСпринтыЗадач_ПоЭтомуСпринту(Отказ);
	
	СформироватьЗапись_узСпринтыЗадач(Отказ);
	
КонецПроцедуры

Процедура СформироватьЗапись_узСпринтыЗадач(Отказ)
	
	Если Отказ Тогда
		Возврат;
	Конецесли;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		Возврат;
	Конецесли;		
	
	Для Каждого СтрокаТЧЗадачи Из ТЧЗадачи Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧЗадачи.Задача) Тогда
			Продолжить;
		Конецесли;
		
		МенеджерЗаписи = РегистрыСведений.узСпринтыЗадач.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Период = ДатаНачала;
		МенеджерЗаписи.Задача = СтрокаТЧЗадачи.Задача;
		МенеджерЗаписи.Спринт = Ссылка;
				
		МенеджерЗаписи.Записать();
	КонецЦикла;	
	
КонецПроцедуры 

Процедура ОчиститьЗаписи_узСпринтыЗадач_ПоЭтомуСпринту(Отказ)
	
	Если Отказ Тогда
		Возврат;
	Конецесли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	узСпринтыЗадач.Период,
	|	узСпринтыЗадач.Задача,
	|	узСпринтыЗадач.Спринт
	|ИЗ
	|	РегистрСведений.узСпринтыЗадач КАК узСпринтыЗадач
	|ГДЕ
	|	узСпринтыЗадач.Спринт = &Спринт";
	
	Запрос.УстановитьПараметр("Спринт",Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	Конецесли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.узСпринтыЗадач.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Период = Выборка.Период;
		МенеджерЗаписи.Задача = Выборка.Задача;
		МенеджерЗаписи.Спринт = Выборка.Спринт;
		
		МенеджерЗаписи.Удалить();
	КонецЦикла;	
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = ТекущаяДата();
	Конецесли;
	
КонецПроцедуры
